---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsRunType
source: html/310c93f6-9401-a90a-e049-f886e67c92e7.htm
---
# StairsRunType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.